{
    "text_name": "Abdo-Mohamed",
    "home": "Home",
    "about": "About",
    "work": "Work",
    "contact": "Contact",
    "language": "Language",
    "hero_title": "M7LAWY 🏴‍☠",
    "hero_role1": "Frontend Dev",
    "hero_role2": "Web Designer",
    "hero_description": "Front-End<br/>React.js, Vue.js, JavaScript (ES6+), Tailwind CSS، Bootstrap<br/>Back-End: Node.js, APIs<br/>Version Control: Git, GitHub",
    "download_cv": "Download CV",
    "work_movies": "Movies",
    "work_movies_des": "A movie search application that allows users to search for movies, view details, and explore popular films using the OMDB API.",
    "work_leaves": "Designs",
    "work_leaves_des": "A leaf recognition app that identifies different types of leaves using image processing and machine learning techniques.",
    "work_restaurant": "Restaurant",
    "work_restaurant_des": "A restaurant website featuring a menu, reservation system, and contact information with a visually appealing design.",
    "work_arino": "Company",
    "work_arino_des": "Responsive website template for agencies and businesses to showcase services, projects, and connect with clients.",
    "work_portfolio": "portfolio",
    "work_portfolio_des": "A personal portfolio website to showcase projects, skills, and experiences with a clean and modern design.",
    "work_live": "Live",
    "work_description": "Check out some of my work",

    "text_contact": "Contact Me",
    "text_contact_whatsapp": "Contact me via WhatsApp",
    "text_contact_email": "Contact me via Email",
    "text_contact_linked": "Contact me via LinkedIn",

    "skills_description": "My tech stack",

    "about_title": "About me",
    "about_description_1": "I’m Abdelrahman, a Front-End Developer specialized in designing and developing websites and e-commerce stores such as Shopify, Wix, Zid, and NicePage. I have experience building landing pages, personal websites, and large-scale projects with a strong focus on performance and user experience",
    "about_description_2": "I have solid expertise in building user interfaces with React.js and Next.js, along with strong skills in HTML, CSS, and JavaScript, and frameworks like Bootstrap and Tailwind CSS. I also have experience with Node.js and Strapi to create dynamic and scalable websites, in addition to supporting multilingual websites using i18n",
    "about_description_3": "I always aim to write clean and well-structured code with great attention to detail, ensuring smooth user experiences and high performance. I also have experience in SEO optimization, e-commerce performance improvements, design enhancements, and tool integrations, providing professional, responsive solutions tailored to client needs",


    


    "cv_title": "Veiw CV",
    "jobTitle": "Frontend Developer",
    "aboutTextCV": "Frontend developer with strong skills in building responsive web interfaces using React, Tailwind, and JavaScript. Passionate about UI/UX and clean design.",
    "disCV": "Mahalla El-Kubra, Egypt | abdomohamed@gmail.com | +201149270139",
    
    "education": "Education",
    "edu1": "Delta Higher Institute for Computers and Information – Mansoura",
    "edu2": "B.Sc. in Business Information Systems",

    "skills": "Skills",
    "experience": "Experience",
    "exp1": "Frontend Developer – 2023-Present",

    "freelance": "Freelance Projects",
    "freelance1": "Developed landing pages and custom sections for Shopify stores.",
    "freelance2": "Built multi-language websites using React and i18next.",
    "freelance3": "Customized Wix, Shopify, and Nicepage stores based on client needs.",
    "freelance4": "Implemented sliders, forms, and interactive sections using pure CSS and Liquid.",

    "languages": "Languages",
    "lang1": "Arabic – Native",
    "lang2": "English – Professional",

    "certificates": "Certificates",
    "cert1": "Frontend Development Diploma",
    "cert2": "FreeCodeCamp Frontend Certificate",
    "cert3": "Google UX Certificate",


    "footer_title": "D. A.M",
    "footer_des": "Designed & Developed by Abdo-Mohamed"
}